In [3]:
import numpy as np
import pandas as pd

In [6]:
first_series=pd.Series(list('abcdef'))
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [8]:
np_country=np.array(['India','Canada','USA','China','Japan'])
country_series=pd.Series(np_country)
print(country_series)

0     India
1    Canada
2       USA
3     China
4     Japan
dtype: object

In [10]:
country_gdp=pd.Series([551,451,351,652.035,452.11],index=['India','Canada','USA','China','Japan'])
print(country_gdp)

India     551.000
Canada    451.000
USA       351.000
China     652.035
Japan     452.110
dtype: float64

In [12]:
scalar_series=pd.Series(5.,index=['a','b','c','d','e'])
print(scalar_series)

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [14]:
olympic_list={'Hostcity':['London','Beijing','Athens','Sydney','Atlanta'],
              'Year':[2012,2008,2004,2000,1996],
              'No. of participating countries':[205,204,201,200,196]}
df_olympic_list=pd.DataFrame(olympic_list)
print(df_olympic_list)

  Hostcity  Year  No. of participating countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             196

In [17]:
df_olympic_list.Hostcity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: Hostcity, dtype: object

In [18]:
df_olympic_list.describe

<bound method NDFrame.describe of   Hostcity  Year  No. of participating countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2004                             201
3   Sydney  2000                             200
4  Atlanta  1996                             196>

In [16]:
dict_olylist={'London':{2012:205},'Beijing':{2008:204}}
df_olylist=pd.DataFrame(dict_olylist)
print(df_olylist)

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [20]:
df_movie_rating=pd.DataFrame({'Movie 1':[5,4,3,2,1],
                          'Movie 2':[2,5,3,4,1]},
                          index=['Likith','Priyanka','Meghana','Chirag','Nayana'])
df_movie_rating

          Movie 1  Movie 2
Likith          5        2
Priyanka        4        5
Meghana         3        3
Chirag          2        4
Nayana          1        1

In [22]:
def movie_grade(x):
    if x==5:
        return 'A'
    if x==4:
        return 'B'
    if x==3:
        return 'C'
    if x==2:
        return 'D'
    if x==1:
        return 'E'
print(movie_grade(5))

A

In [23]:
df_movie_rating.applymap(movie_grade)

         Movie 1 Movie 2
Likith         A       D
Priyanka       B       A
Meghana        C       C
Chirag         D       B
Nayana         E       E

In [24]:
df_movie_rating.max()

Movie 1    5
Movie 2    5
dtype: int64

In [25]:
df_movie_rating.mean()

Movie 1    3.0
Movie 2    3.0
dtype: float64

In [26]:
df_movie_rating.std()

Movie 1    1.581139
Movie 2    1.581139
dtype: float64